export const answersLaw = [
  {id: 1, t: "Трудовой кодекс РФ"},
  {id: 2, t: "Гражданский кодекс РФ"},
  {id: 3, t: "Федеральный закон «Об охране труда»"},
  {id: 4, t: "Уголовный кодекс РФ"},
  {id: 5, t: "ФЗ о занятости населения"},
  {id: 6, t: "Локальные нормативные акты организации"},
  {id: 7, t: "Коллективный договор"},
  {id: 8, t: "Конституция РФ"},
]
export const questionsLaw = [
  { q: "Какой закон является основным источником трудового права РФ?", va: [1] },
  { q: "Какие из перечисленных документов регулируют охрану труда в РФ?", va: [1,3] },
  { q: "Что регулирует право на отпуск?", va: [1] },
  { q: "Какие нормативные акты регулируют порядок заключения трудового договора?", va: [1,5] },
  { q: "Что устанавливает основания для расторжения трудового договора работодателем?", va: [1] },
  { q: "Какие из документов устанавливают правила привлечения работников к дисциплинарной ответственности?", va: [1,6] },
  { q: "Каким нормативным актом регулируется работа с несовершеннолетними?", va: [1] },
  { q: "Какие документы содержат нормы о гарантированных выплатах при увольнении?", va: [1,7] },
  { q: "Какой федеральный закон регулирует занятость населения?", va: [5] },
  { q: "Какие нормативные акты регулируют дистанционную работу?", va: [1,8] },
]

export const answersTheory = [
  { id: 1, t: "Принцип свободы труда" },
  { id: 2, t: "Принцип социального партнерства" },
  { id: 3, t: "Отношения между работодателем и работником" },
  { id: 4, t: "Отношения по трудовому договору" },
  { id: 5, t: "Обеспечить безопасные условия труда" },
  { id: 6, t: "Своевременно выплачивать зарплату" }
];
export const questionsTheory = [
  { q: "Какие принципы трудового права закреплены в Трудовом кодексе РФ?", va: [1,2] },
  { q: "Какие из перечисленных отношений являются трудовыми?", va: [3,4] },
  { q: "Какие обязанности возлагаются на работодателя?", va: [5,6] },
  { q: "Какие принципы и отношения определяют трудовое право?", va: [1,3] },
  { q: "Какие действия работодатель обязан выполнять в рамках Трудового кодекса?", va: [5,6] },
  { q: "Какие категории отношений регулируются трудовым законодательством?", va: [3,4] },
  { q: "Какие принципы лежат в основе трудового договора?", va: [1,2] },
  { q: "Что обязателен работодатель для соблюдения прав работников?", va: [5,6] },
  { q: "Какие отношения определяют права и обязанности сторон трудового договора?", va: [3,4] },
  { q: "Какие принципы и обязанности характеризуют трудовое право?", va: [1,6] }
];
