export const answers_law = [
  {id: 1, t: "Трудовой кодекс РФ"},
  {id: 2, t: "Гражданский кодекс РФ"},
  {id: 3, t: "Федеральный закон «Об охране труда»"},
  {id: 4, t: "Уголовный кодекс РФ"},
  {id: 5, t: "ФЗ о занятости населения"},
  {id: 6, t: "Локальные нормативные акты организации"},
  {id: 7, t: "Коллективный договор"},
  {id: 8, t: "Конституция РФ"},
]

export const questions_law = [
  {
    q: "Какой закон является основным источником трудового права РФ?",
    va: [1]
  },
  {
    q: "Какие из перечисленных документов регулируют охрану труда в РФ?",
    va: [1,3]
  },
  {
    q: "Что регулирует право на отпуск?",
    va: [1]
  },
  {
    q: "Какие нормативные акты регулируют порядок заключения трудового договора?",
    va: [1,5]
  },
  {
    q: "Что устанавливает основания для расторжения трудового договора работодателем?",
    va: [1]
  },
  {
    q: "Какие из документов устанавливают правила привлечения работников к дисциплинарной ответственности?",
    va: [1,6]
  },
  {
    q: "Каким нормативным актом регулируется работа с несовершеннолетними?",
    va: [1]
  },
  {
    q: "Какие документы содержат нормы о гарантированных выплатах при увольнении?",
    va: [1,7]
  },
  {
    q: "Какой федеральный закон регулирует занятость населения?",
    va: [5]
  },
  {
    q: "Какие нормативные акты регулируют дистанционную работу?",
    va: [1,8]
  },
]

