export const answersLaw = [
  {id: 1, t: "Трудовой кодекс РФ"},
  {id: 2, t: "Гражданский кодекс РФ"},
  {id: 3, t: "Федеральный закон «Об охране труда»"},
  {id: 4, t: "Уголовный кодекс РФ"},
  {id: 5, t: "ФЗ о занятости населения"},
  {id: 6, t: "Локальные нормативные акты организации"},
  {id: 7, t: "Коллективный договор"},
  {id: 8, t: "Конституция РФ"},
]
export const questionsLaw = [
  { q: "Какой закон является основным источником трудового права РФ?", va: [1] },
  { q: "Какие из перечисленных документов регулируют охрану труда в РФ?", va: [1,3] },
  { q: "Что регулирует право на отпуск?", va: [1] },
  { q: "Какие нормативные акты регулируют порядок заключения трудового договора?", va: [1,5] },
  { q: "Что устанавливает основания для расторжения трудового договора работодателем?", va: [1] },
  { q: "Какие из документов устанавливают правила привлечения работников к дисциплинарной ответственности?", va: [1,6] },
  { q: "Каким нормативным актом регулируется работа с несовершеннолетними?", va: [1] },
  { q: "Какие документы содержат нормы о гарантированных выплатах при увольнении?", va: [1,7] },
  { q: "Какой федеральный закон регулирует занятость населения?", va: [5] },
  { q: "Какие нормативные акты регулируют дистанционную работу?", va: [1,8] },
]

export const answersTheory = [
  { id: 1, t: "Трудовой договор" },
  { id: 2, t: "Письменная форма" },
  { id: 3, t: "Работодатель" },
  { id: 4, t: "3 месяца" },
  { id: 5, t: "Условия оплаты труда" },
  { id: 6, t: "Не реже двух раз в месяц" },
  { id: 7, t: "Трудовые и связанные с ними отношения" },
  { id: 8, t: "Социальная направленность" },
  { id: 9, t: "Да, по соглашению сторон" },
  { id: 10, t: "Свобода труда" }
];
export const questionsTheory = [
  { q: "Что является основанием возникновения трудовых отношений?", va: [1] },
  { q: "В какой форме заключается трудовой договор?", va: [2] },
  { q: "Что подтверждает приём работника на работу?", va: [1,3] },
  { q: "Может ли устанавливаться испытательный срок?", va: [9] },
  { q: "Максимальная продолжительность испытательного срока", va: [4] },
  { q: "Что обязательно указывается в трудовом договоре?", va: [5] },
  { q: "Как выплачивается заработная плата работнику?", va: [6] },
  { q: "За что работник несёт материальную ответственность?", va: [7] },
  { q: "Что относится к принципам трудового права?", va: [8,10] },
  { q: "Что является основой правового регулирования труда?", va: [1] }
];